; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v8 - type_1 ?v4 - type_2)
 	      (pred_1 ?v3 - object ?v4 - type_2)
	      (pred_4 ?v8 - type_1 ?v6 - type_3)
	      (pred_3 ?v8 - type_1 ?v3 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v8 - type_1 ?v1 ?v5 - type_2)
       :precondition (and  (pred_2 ?v8 ?v1))
       :effect (and  (pred_2 ?v8 ?v5)
		     (not (pred_2 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_1 ?v7 - object ?v2 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v2) (pred_2 ?v8 ?v2) (pred_4 ?v8 ?v6))
       :effect (and (pred_3 ?v8 ?v7 ?v6)
		    (not (pred_1 ?v7 ?v2)) 
		    (not (pred_4 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_1 ?v7 - object ?v2 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v7 ?v6) (pred_2 ?v8 ?v2))
       :effect (and (pred_1 ?v7 ?v2)
		    (pred_4 ?v8 ?v6)
		    (not (pred_3 ?v8 ?v7 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_05 obj_03 - type_3
obj_06 obj_04 obj_09 - type_2
obj_07 obj_01 obj_08 - object)
(:init
(pred_2 obj_02 obj_04)
(pred_4 obj_02 obj_05)
(pred_4 obj_02 obj_03)
(pred_1 obj_07 obj_04)
(pred_1 obj_01 obj_06)
(pred_1 obj_08 obj_04)
)
(:goal
(and
(pred_1 obj_07 obj_06)
(pred_1 obj_01 obj_06)
(pred_1 obj_08 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_02 ?b obj_03))))
)
)

; plan
1. (op_1 obj_02 obj_07 obj_04 obj_05)
   deleted: (pred_1 obj_07 obj_04) (pred_4 obj_02 obj_05)
   added: (pred_3 obj_02 obj_07 obj_05)
   goals met: 1 of 3
2. (op_3 obj_02 obj_04 obj_06)
   deleted: (pred_2 obj_02 obj_04)
   added: (pred_2 obj_02 obj_06)
   goals met: 1 of 3
3. (op_2 obj_02 obj_07 obj_06 obj_05)
   deleted: (pred_3 obj_02 obj_07 obj_05)
   added: (pred_1 obj_07 obj_06) (pred_4 obj_02 obj_05)
   goals met: 2 of 3
4. (op_3 obj_02 obj_06 obj_04)
   deleted: (pred_2 obj_02 obj_06)
   added: (pred_2 obj_02 obj_04)
   goals met: 2 of 3
5. (op_1 obj_02 obj_08 obj_04 obj_05)
   deleted: (pred_1 obj_08 obj_04) (pred_4 obj_02 obj_05)
   added: (pred_3 obj_02 obj_08 obj_05)
   goals met: 2 of 3
6. (op_3 obj_02 obj_04 obj_06)
   deleted: (pred_2 obj_02 obj_04)
   added: (pred_2 obj_02 obj_06)
   goals met: 2 of 3
7. (op_2 obj_02 obj_08 obj_06 obj_05)
   deleted: (pred_3 obj_02 obj_08 obj_05)
   added: (pred_1 obj_08 obj_06) (pred_4 obj_02 obj_05)
   goals met: 3 of 3
